Repository: Fafnur/fafnur
Catalog: apps/fafn.*/src/i18n/messages.xlf
Languages: ru

source: Experience
ru: Опыт

source: LLC "Information Technologies", Novosibirsk
ru: ООО "Информационные Технологии", Новосибирск

source: Layout designer
ru: Верстальщик

source: September 2011
ru: Сентябрь 2011

source: february 2012
ru: февраль 2012

source: 6 months
ru: 6 месяцев

source: Layout of sites according to the layout.
ru: Верстка сайтов по макету на внутренней системе компании.

source: NPP Microprocessor Technologies LLC, Novosibirsk,
ru: ООО "НПП Микропроцессорные технологии", Новосибирск.

source: Programmer
ru: Программист

source: February 2012
ru: Февраль 2012

source: february 2015
ru: февраль 2015

source: 3 years
ru: 3 года

source: Creation and support of the company website.
ru: Создание и поддержка сайта компании

source: OOO Glavweb, Novosibirsk,
ru: ООО "Главвеб", Новосибирск

source: January 2015
ru: Январь 2015

source: january 2017
ru: январь 2017

source: 2 years 1 month
ru: 2 года 1 месяц

source: UI/UX development for several marketing agencies.
ru: Разработка front-end составляющей (верстка, интеграция) для нескольких маркетинговых агентств.

source: Back-end development in PHP (symfony, yii, cake).
ru: Разработка back-end части на PHP (symfony, yii, cake).

source: Training new frontend developers
ru: Обучение новых сотрудников frontend-у.

source: LLC FTM PM, Novosibirsk,
ru: ООО "ФТМ ПМ", Новосибирск

source: CEO
ru: Директор

source: October 2017
ru: Октябрь 2017

source: march 2019
ru: март 2019

source: 1 year 6 months
ru: 1 год 6 месяцев

source: Game development on Unity3d and Unreal engine 4.
ru: Разработка игр на Unity3d и Unreal engine 4.

source: Creation of sites and web applications
ru: Создание сайтов и веб-приложений.

source: SGUPS NIL ITT, Novosibirsk,
ru: СГУПС НИЛ ИТТ, Новосибирск

source: Engineer
ru: Инженер

source: August 2016
ru: Август 2016

source: may 2019
ru: май 2019

source: 2 years 10 months
ru: 2 года 10 месяцев

source: Development of an ontology editor using OWL and integration with OWL-based inference systems.
ru: Разработка редактора онтологий с использованием OWL и интеграцией с системами логического вывода основанными на OWL.

source: Stack: Angular, Spring (inference systems), Symfony (cloud storage, OWL generation), Postgresql.
ru: Стек: Angular, Spring (системы логического вывода), Symfony (облачное хранилище, генерация OWL), Postgresql.

source: Institute of Computational Mathematics and Mathematical Geophysics SB RAS, Novosibirsk,
ru: Институт вычислительной математики и математической геофизики СО РАН, Новосибирск.

source: Junior Research Fellow
ru: Младший научный сотрудник

source: July 2018
ru: Июль 2018

source: december 2020
ru: Декабрь 2020

source: 2 years 6 months
ru: 2 года 6 месяцев

source: Development of new numerical methods for partial differential equations for gas, magnetic gas dynamics.
ru: Разработка новых численных методов для уравнений в частных производных для газовой, магнитной газовой динамики.

source: LLC "RUSINTERFINANS", Novosibirsk,
ru: ООО МКК "РУСИНТЕРФИНАНС ", Новосибирск.

source: Frontend developer
ru: Фронтенд-разработчик

source: September 2018
ru: Сентябрь 2018

source: until now
ru: по настоящее время

source: 5 years
ru: 5 лет

source: Migrating old code to new stack: angular, nx, ngrx, universal, l18n.
ru: Миграция старого кода на новый стек: angular, nx, ngrx, universal, l18n.

source: Management of the front-end development team (setting tasks, rallies, code review).
ru: Управление командой фронтенд разработки (постановка задач, митинги, code review).

source: Development of new services on a new stack.
ru: Разработка новых сервисов на новом стеке.

source: Stack
ru: Стек

source: My technology stack that I use:
ru: Мой стек технологий, который я использую и популизирую:

source: The Angular CLI is a command-line interface tool that you use to initialize, develop, scaffold, and maintain Angular applications directly from a command shell.
ru: CLI для создания приложений и компонентов angular.

source: Next generation build system with first class monorepo support and powerful integrations.
ru: монорепозиторий для разработки enterprise приложений.

source: Reactive State for Angular.
ru: реализация Redux в Angular.

source: Server-side rendering (SSR) with Angular Universal.
ru: Server-side rendering в Angular.

source: GraphQL is the developer-friendly query language for the modern web.
ru: GraphQL клиент для Angular.

source: A JavaScript library providing an easy to use api for interacting with iOS and Android platform APIs.
ru: разработка нативных мобильный приложений на Angular.

source: NestJS is a framework for building efficient, scalable Node.js web applications.
ru: Node.js платформа для создания эффективных, надежных и масштабируемых серверных приложений.

source: Who am I?
ru: Кто я?

source: I'm a frontend developer with 7 years of experience specializing in creating beautiful user interfaces with Angular. My technical stack includes JavaScript, TypeScript, Redux, Git, and a monorepo approach.
ru: Я фронтенд-разработчик с более чем 7-летним опытом в создании современных и функциональных веб-приложений. Мой основной стек это: Angular, NX, Universal (SSR), Localization, Redux, TypeScript и JavaScript.

source: Throughout my career, I've developed enterprise applications for the fintech industry, working on projects that have delivered significant value to my clients. I take pride in my ability to work collaboratively with cross-functional teams to deliver high-quality software solutions.
ru: Сейчас я работаю в международной финтех компании, где отвечаю за разработку и поддержку проектов для микрофинонсирования в нескольких странах.

source: In addition to my work, I also write articles about Angular on Medium, sharing my knowledge and insights with the wider development community.
ru: Я активно делюсь знаниями и опытом в своем блоге на Хабре и Medium. Кроме того, веду группы в Telegram и ВК о фронтенде.

source: I believe in the importance of continuously learning and improving, and I'm always seeking out new challenges and opportunities to expand my skill set.
ru: Вы можете посмотреть мои работы в профиле на GitHub. Я всегда стремлюсь к совершенствованию своих навыков и изучению новых технологий. Ищу интересные и сложные задачи, которые позволят мне реализовать свой потенциал и принести пользу обществу.е.

source: Page not found
ru: Страница не найдена

source: Perhaps you were looking for pages
ru: Возможно, вы искали страницы:

source: Home
ru: Главная

source: About
ru: Обо мне

source: Demo projects from article series
ru: Демо проекты из циклов статей

source: Static Blog with Angular and Contentful
ru: Статичный блог на Angular и Contentful

source: An example of a simple news site with Redux
ru: Пример простого новостного сайта с Redux

source: An example of a business card site with a product catalog
ru: Пример сайта визитки с каталогом товаров

source: Articles on Habr
ru: Статьи на Хабре

source: Yandex Cup 2023. How I solved the problem with type definition in Typescript
ru: Решение задачи про определение типа в Typescript с Yandex Cup 2023

source: Creating a Static Blog with Angular and Contentful
ru: Создание статичного блога на Angular и Contentful

source: How I ported a blog from CakePHP to Angular
ru: Как я переносил блог из CakePHP в Angular

source: How Evercookie works in 2023
ru: Как работает Evercookie в 2023 году

source: Redux in Angular. Roundtrip
ru: Redux в Angular. Туда и обратно

source: How I made a business card website in Angular
ru: Как я делал сайт визитку на Angular

source: Typescript app development using Nx
ru: Разработка приложений на Typescript с использованием Nx

source: How Angular drives front-end developers into enterprise bondage
ru: Как Angular загоняет фронтенд разработчиков в enterprise-кабалу

source: How I wrote a test task in Angular and why some developers should not be given a test task
ru: Как я писал тестовое задание на Angular и почему некоторым разработчикам не стоит давать тестовое задание

source: Posts on Medium
ru: Статьи на Медиуме

source: Миграция на NX 17.
ru: Перевод Angular проекта на standalone компоненты.

source: Transferring an Angular project to standalone components.
ru: Перевод Angular проекта на standalone компоненты.

source: Creating Material font and svg icons without Angular Material.
ru: Создание иконок Material font и svg без Angular Material.

source: Redux in Angular. State management using standard Angular tools.
ru: Redux в Angular. State management стандартными средствами Angular.

source: Redux in Angular. Introduction.
ru: Redux в Angular. Введение.

source: Setting up husky in an Angular project. Migration from version 4 to version 8.
ru: Настройка husky в проекте Angular. Миграция с 4 до 8 версии.

source: Using SVG Icons with Angular Material
ru: Использование SVG иконок с помощью Angular Material.

source: Typed Forms in Angular
ru: Типизированные формы в Angular.

source: Business card website in Angular. Introduction
ru: Сайт-визитка на Angular. Введение.

source: Setting up Angular Universal with Angular Localization
ru: Настройка Angular Universal с Angular Localization.

source: Banx. Designing Registration with Angular
ru: Banx. Проектирование регистрации на Angular.

source: Banx. Implementing Browser Fingerprinting in Angular.
ru: Banx. Реализация отпечатков пальцев браузера в Angular.

source: Banx. Creating a user event tracker in Angular..
ru: Banx. Создание трекера событий пользователя в Angular.

source: Banx. Flexible templates with routerOutlet in Angular.
ru: Banx. Гибкие шаблоны с routerOutlet в Angular.

source: Banx. Building the NestJS API + TypeOrm + Mariadb.
ru: Banx. Создание API NestJS + TypeOrm + Mariadb.

source: Test task in Angular. Introduction.
ru: Тестовое задание на Angular. Введение.

source: Banx. Creating a fake API with json-server.
ru: Тестовое задание на Angular. Введение.

source: Banx. Basics of layout in Angular using the example of creating error pages.
ru: Banx. Основы верстки в Angular на примере создания страниц ошибок.

source: Angular docs. App Navigation: Routing in Views.
ru: Angular docs. Навигация в приложении: маршрутизация в представлениях.

source: Banx. Creating a basic layout in Angular.
ru: Banx. Создание базового лейаута в Angular.

source: Angular docs. Style Priorities.
ru: Angular docs. Приоритеты стилей.

source: Banx. Creating an Nx workspace for Angular
ru: Banx. Создание Nx workspace для Angular.

source: CSS solutions. Creating a Grid, Columns and Grids
ru: CSS решения. Создание сетки, колонок и гридов.

source: CSS solutions. Fixed block plus adaptive block.
ru: CSS решения. Фиксированный блок плюс адаптивный блок.

source: Angular component testing with Jest
ru: Angular тестирование component с помощью Jest.

source: Architecture of enterprise Angular applications using Nx monorepository
ru: Архитектура enterprise Angular приложений с использованием монорепозитория Nx.

source: Structure and approaches to organizing actions, selectors, reducers and effects in Ngrx and Nx
ru: Структура и подходы к организации экшенов, селекторов, редьюсеров и эффектов в Ngrx и Nx.

source: Redux in Angular. Managing states in Angular with Ngrx and Nx.
ru: Redux в Angular. Управление состояниями в Angular с помощью Ngrx и Nx.

source: Infinite Scroll in Angular 9 with Intersection Observer API.
ru: Бесконечный скролл в Angular 9 с помощью Intersection Observer API.

source: What is it like to learn JavaScript in 2020
ru: Каково учить JavaScript в 2020

source: GraphQL API integration in Angular app
ru: Интеграция GraphQL API в Angular приложение

source: Create a mono repository based on angular/cli without Nx or Lerna
ru: Создаем моно репозиторий на основе angular/cli без Nx или Lerna

source: GraphQL API for Angular with NX and Nest
ru: GraphQL API для Angular с помощью NX и Nest

source: Development of a slider (carousel) on Angular with Rxjs
ru: Разработка слайдера (карусели) на Angular c Rxjs

source: How to choose the right front-end framework or why you can't trust the comparison of frameworks
ru: Как правильно выбрать фронтенд framework или почему нельзя верить сравнению фреймверков

source: Test your knowledge of JavaScript syntax in the game "What will be displayed"
ru: Проверь себя на знание синтаксиса JavaScript в игре "Что выведется"

source: BEM and the naming problem. Speeding up and standardizing naming in HTML and CSS
ru: БЭМ и проблема наименования. Ускоряем и стандартизируем нейминг в HTML и CSS

source: The seven deadly sins of a coder
ru: Семь смертных грехов верстальщика

source: Basics of layout in Angular with Redux and Nx. Part 1. Layout Header and Navbar.
ru: Основы верстки в Angular c Redux и Nx. Часть 1. Верстка Header и Navbar.

source: The Seven Deadly Sins of a Frontend/JavaScript Developer
ru: Семь смертных грехов Фронтенд/JavaScript разработчика.

source: Go to post
ru: Перейти к статье

source: Read more
ru: Подробнее

source: Collaboration
ru: Сотрудничество

source: For cooperation, please write to the telegram: <a href="//t.me/fafnur" target="_blank" rel="nofollow" (click)="onCollaboration()">@fafnur</a>
ru: По вопросам сотрудничества, пишите в телеграм: <a href="//t.me/fafnur" target="_blank" rel="nofollow" (click)="onCollaboration()">@fafnur</a>

source: Resume
ru: Резюме

source: Download <a href="/assets/docs/serenko.pdf" target="_blank" rel="nofollow" (click)="onDownload()"> PDF</a>
ru: Скачать <a href="/assets/docs/serenko.pdf" target="_blank" rel="nofollow" (click)="onDownload()"> PDF</a>

source: Life
ru: Жизнь

source: I share everything wonderful that I meet in life on telegram: <a href="https://t.me/fafnur_life" target="_blank" rel="nofollow" (click)="onLife()">fafnur_life</a>
ru: Делюсь всем замечательным, что встречаю в жизни в телеграм <a href="https://t.me/fafnur_life" target="_blank" rel="nofollow" (click)="onLife()">fafnur_life</a>

source: Choose a path
ru: Выбери путь

source: Remember... All I'm Offering Is The Truth. Nothing More.
ru: Помни: Я лишь предлагаю узнать правду, ничего больше.

source: About
ru: Обо мне

source: Front-end Developer, Angular evangelist, Nx apologist, NodeJS warlock. Writing about the frontend.
ru: Фронтендер, Angular евангелист, Nx апологет, NodeJS чернокнижник. Пишу статьи про фронтенд.

source: Connect me
ru: Свяжитесь со мной

source: ©{{ year }} All rights reserved
ru: ©{{ year }} Все права защищены, но это не точно.

source: Open about page
ru: Открыть страницу обо мне

source: Go to github
ru: Перейти на github

source: Toggle language
ru: Переключить язык

source: Go to home page
ru: Перейти на главную страницу

source: Close main menu
ru: Закрыть меню

source: Toggle main menu
ru: Открыть или закрыть меню
